tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1613_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1613_H_
#define _PIC16LF1613_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTC                         42
#define RC0                           43
#define RC1                           44
#define RC2                           45
#define RC3                           46
#define RC4                           47
#define RC5                           48
#define PIR1                          49
#define TMR1IF                        50
#define TMR2IF                        51
#define CCP1IF                        52
#define ADIF                          53
#define TMR1GIF                       54
#define PIR2                          55
#define CCP2IF                        56
#define TMR4IF                        57
#define TMR6IF                        58
#define C1IF                          59
#define C2IF                          60
#define PIR3                          61
#define ZCDIF                         62
#define CWGIF                         63
#define PIR4                          64
#define SMT1IF                        65
#define SMT1PRAIF                     66
#define SMT1PWAIF                     67
#define SMT2IF                        68
#define SMT2PRAIF                     69
#define SMT2PWAIF                     70
#define CRCIF                         71
#define SCANIF                        72
#define TMR0                          73
#define TMR1L                         74
#define TMR1H                         75
#define T1CON                         76
#define TMR1ON                        77
#define nT1SYNC                       78
#define T1CKPS0                       79
#define T1CKPS                        80
#define T1CKPS1                       81
#define TMR1CS0                       82
#define TMR1CS                        83
#define TMR1CS1                       84
#define T1GCON                        85
#define T1GSS0                        86
#define T1GSS                         87
#define T1GSS1                        88
#define T1GVAL                        89
#define T1GGO_nDONE                   90
#define T1GSPM                        91
#define T1GTM                         92
#define T1GPOL                        93
#define TMR1GE                        94
#define T2TMR                         95
#define TMR2                          96
#define T2PR                          97
#define PR2                           98
#define T2CON                         99
#define T2OUTPS0                      100
#define T2CON_OUTPS0                  101
#define T2OUTPS                       102
#define T2CON_OUTPS                   103
#define T2OUTPS1                      104
#define T2CON_OUTPS1                  105
#define T2OUTPS2                      106
#define T2CON_OUTPS2                  107
#define T2OUTPS3                      108
#define T2CON_OUTPS3                  109
#define T2CKPS0                       110
#define T2CON_CKPS                    111
#define T2CKPS                        112
#define T2CON_CKPS0                   113
#define T2CKPS1                       114
#define T2CON_CKPS1                   115
#define T2CKPS2                       116
#define T2CON_CKPS2                   117
#define T2CON_ON                      118
#define TMR2ON                        119
#define T2ON                          120
#define T2HLT                         121
#define T2HLT_MODE                    122
#define T2MODE0                       123
#define T2HLT_MODE0                   124
#define T2MODE                        125
#define T2HLT_MODE1                   126
#define T2MODE1                       127
#define T2MODE2                       128
#define T2HLT_MODE2                   129
#define T2HLT_MODE3                   130
#define T2MODE3                       131
#define T2HLT_CKSYNC                  132
#define T2CKSYNC                      133
#define T2HLT_CKPOL                   134
#define T2CKPOL                       135
#define T2PSYNC                       136
#define T2HLT_PSYNC                   137
#define T2CLKCON                      138
#define T2CS                          139
#define T2CS0                         140
#define T2CS1                         141
#define T2CS2                         142
#define T2RST                         143
#define T2RSEL0                       144
#define T2RST_RSEL                    145
#define T2RSEL                        146
#define T2RST_RSEL0                   147
#define T2RSEL1                       148
#define T2RST_RSEL1                   149
#define T2RST_RSEL2                   150
#define T2RSEL2                       151
#define T2RSEL3                       152
#define T2RST_RSEL3                   153
#define TRISA                         154
#define TRISA0                        155
#define TRISA1                        156
#define TRISA2                        157
#define TRISA3                        158
#define TRISA4                        159
#define TRISA5                        160
#define TRISC                         161
#define TRISC0                        162
#define TRISC1                        163
#define TRISC2                        164
#define TRISC3                        165
#define TRISC4                        166
#define TRISC5                        167
#define PIE1                          168
#define TMR1IE                        169
#define TMR2IE                        170
#define CCP1IE                        171
#define ADIE                          172
#define TMR1GIE                       173
#define PIE2                          174
#define CCP2IE                        175
#define TMR4IE                        176
#define TMR6IE                        177
#define C1IE                          178
#define C2IE                          179
#define PIE3                          180
#define ZCDIE                         181
#define CWGIE                         182
#define PIE4                          183
#define SMT1IE                        184
#define SMT1PRAIE                     185
#define SMT1PWAIE                     186
#define SMT2IE                        187
#define SMT2PRAIE                     188
#define SMT2PWAIE                     189
#define CRCIE                         190
#define SCANIE                        191
#define OPTION_REG                    192
#define PS                            193
#define PS0                           194
#define PS1                           195
#define PS2                           196
#define PSA                           197
#define T0SE                          198
#define TMR0SE                        199
#define T0CS                          200
#define TMR0CS                        201
#define INTEDG                        202
#define nWPUEN                        203
#define PCON                          204
#define nBOR                          205
#define nPOR                          206
#define nRI                           207
#define nRMCLR                        208
#define nRWDT                         209
#define nWDTWV                        210
#define STKUNF                        211
#define STKOVF                        212
#define OSCTUNE                       213
#define TUN0                          214
#define TUN                           215
#define TUN1                          216
#define TUN2                          217
#define TUN3                          218
#define TUN4                          219
#define TUN5                          220
#define OSCCON                        221
#define SCS0                          222
#define SCS                           223
#define SCS1                          224
#define IRCF                          225
#define IRCF0                         226
#define IRCF1                         227
#define IRCF2                         228
#define IRCF3                         229
#define SPLLEN                        230
#define OSCSTAT                       231
#define HFIOFS                        232
#define LFIOFR                        233
#define MFIOFR                        234
#define HFIOFL                        235
#define HFIOFR                        236
#define PLLR                          237
#define ADRESL                        238
#define ADRESH                        239
#define ADCON0                        240
#define ADON                          241
#define GO_nDONE                      242
#define GO                            243
#define ADGO                          244
#define CHS0                          245
#define CHS                           246
#define CHS1                          247
#define CHS2                          248
#define CHS3                          249
#define CHS4                          250
#define ADCON1                        251
#define ADPREF0                       252
#define ADPREF                        253
#define ADPREF1                       254
#define ADCS0                         255
#define ADCS                          256
#define ADCS1                         257
#define ADCS2                         258
#define ADFM                          259
#define ADCON2                        260
#define TRIGSEL                       261
#define TRIGSEL0                      262
#define TRIGSEL1                      263
#define TRIGSEL2                      264
#define TRIGSEL3                      265
#define LATA                          266
#define LATA0                         267
#define LATA1                         268
#define LATA2                         269
#define LATA3                         270
#define LATA4                         271
#define LATA5                         272
#define LATC                          273
#define LATC0                         274
#define LATC1                         275
#define LATC2                         276
#define LATC3                         277
#define LATC4                         278
#define LATC5                         279
#define CM1CON0                       280
#define C1SYNC                        281
#define C1HYS                         282
#define C1SP                          283
#define C1POL                         284
#define C1OE                          285
#define C1OUT                         286
#define C1ON                          287
#define CM1CON1                       288
#define C1NCH0                        289
#define C1NCH                         290
#define C1NCH1                        291
#define C1NCH2                        292
#define C1PCH                         293
#define C1PCH0                        294
#define C1PCH1                        295
#define C1INTN                        296
#define C1INTP                        297
#define CM2CON0                       298
#define C2SYNC                        299
#define C2HYS                         300
#define C2SP                          301
#define C2POL                         302
#define C2OE                          303
#define C2OUT                         304
#define C2ON                          305
#define CM2CON1                       306
#define C2NCH0                        307
#define C2NCH                         308
#define C2NCH1                        309
#define C2NCH2                        310
#define C2PCH                         311
#define C2PCH0                        312
#define C2PCH1                        313
#define C2INTN                        314
#define C2INTP                        315
#define CMOUT                         316
#define MC1OUT                        317
#define MC2OUT                        318
#define BORCON                        319
#define BORRDY                        320
#define BORFS                         321
#define SBOREN                        322
#define FVRCON                        323
#define ADFVR0                        324
#define ADFVR                         325
#define ADFVR1                        326
#define CDAFVR                        327
#define CDAFVR0                       328
#define CDAFVR1                       329
#define TSRNG                         330
#define TSEN                          331
#define FVRRDY                        332
#define FVREN                         333
#define DAC1CON0                      334
#define DAC1PSS                       335
#define D1PSS0                        336
#define D1PSS1                        337
#define DAC1OE                        338
#define DAC1EN                        339
#define DAC1CON1                      340
#define DAC1R                         341
#define DAC1R0                        342
#define DAC1R1                        343
#define DAC1R2                        344
#define DAC1R3                        345
#define DAC1R4                        346
#define DAC1R5                        347
#define DAC1R6                        348
#define DAC1R7                        349
#define ZCD1CON                       350
#define ZCD1INTN                      351
#define ZCD1INTP                      352
#define ZCD1POL                       353
#define ZCD1OUT                       354
#define ZCD1OE                        355
#define ZCD1EN                        356
#define APFCON                        357
#define CCP2SEL                       358
#define T1GSEL                        359
#define ANSA0                         360
#define ANSELA                        361
#define ANSA1                         362
#define ANSA2                         363
#define ANSA4                         364
#define ANSC0                         365
#define ANSELC                        366
#define ANSC1                         367
#define ANSC2                         368
#define ANSC3                         369
#define PMADRL                        370
#define PMADRH                        371
#define PMDATL                        372
#define PMDATH                        373
#define PMCON1                        374
#define RD                            375
#define WR                            376
#define WREN                          377
#define WRERR                         378
#define FREE                          379
#define LWLO                          380
#define CFGS                          381
#define PMCON2                        382
#define WPUA                          383
#define WPUA0                         384
#define WPUA_WPUA                     385
#define WPUA1                         386
#define WPUA2                         387
#define WPUA3                         388
#define WPUA4                         389
#define WPUA5                         390
#define WPUC                          391
#define WPUC0                         392
#define WPUC_WPUA                     393
#define WPUC1                         394
#define WPUC2                         395
#define WPUC3                         396
#define WPUC4                         397
#define WPUC5                         398
#define ODCONA                        399
#define ODA0                          400
#define ODA1                          401
#define ODA2                          402
#define ODA4                          403
#define ODA5                          404
#define ODCONC                        405
#define ODC0                          406
#define ODC1                          407
#define ODC2                          408
#define ODC3                          409
#define ODC4                          410
#define ODC5                          411
#define CCPR1L                        412
#define CCPR1L_RL                     413
#define CCPR1H                        414
#define CCPR1H_RH                     415
#define CCP1CON                       416
#define CCP1MODE0                     417
#define CCP1CON_MODE0                 418
#define CCP1CON_MODE                  419
#define CCP1MODE                      420
#define CCP1MODE1                     421
#define CCP1CON_MODE1                 422
#define CCP1MODE2                     423
#define CCP1CON_MODE2                 424
#define CCP1MODE3                     425
#define CCP1CON_MODE3                 426
#define CCP1FMT                       427
#define CCP1CON_FMT                   428
#define CCP1CON_OUT                   429
#define CCP1OUT                       430
#define CCP1CON_OE                    431
#define CCP1OE                        432
#define CCP1EN                        433
#define CCP1CON_EN                    434
#define CCP1CAP                       435
#define CCP1CTS0                      436
#define CCP1CAP_CTS                   437
#define CCP1CAP_CTS0                  438
#define CCP1CTS                       439
#define CCP1CTS1                      440
#define CCP1CAP_CTS1                  441
#define CCPR2L                        442
#define CCPR2L_RL                     443
#define CCPR2H                        444
#define CCPR2H_RH                     445
#define CCP2CON                       446
#define CCP2MODE                      447
#define CCP2MODE0                     448
#define CCP2CON_MODE0                 449
#define CCP2CON_MODE                  450
#define CCP2MODE1                     451
#define CCP2CON_MODE1                 452
#define CCP2MODE2                     453
#define CCP2CON_MODE2                 454
#define CCP2MODE3                     455
#define CCP2CON_MODE3                 456
#define CCP2FMT                       457
#define CCP2CON_FMT                   458
#define CCP2OUT                       459
#define CCP2CON_OUT                   460
#define CCP2OE                        461
#define CCP2CON_OE                    462
#define CCP2EN                        463
#define CCP2CON_EN                    464
#define CCP2CAP                       465
#define CCP2CAP_CTS                   466
#define CCP2CAP_CTS0                  467
#define CCP2CTS                       468
#define CCP2CTS0                      469
#define CCP2CAP_CTS1                  470
#define CCP2CTS1                      471
#define CCPTMRS                       472
#define CCP1TSEL0                     473
#define CCP1TSEL                      474
#define CCP1TSEL1                     475
#define CCP2TSEL0                     476
#define CCP2TSEL                      477
#define CCP2TSEL1                     478
#define SLRCONA                       479
#define SLRA0                         480
#define SLRA1                         481
#define SLRA2                         482
#define SLRA4                         483
#define SLRA5                         484
#define SLRCONC                       485
#define SLRC0                         486
#define SLRC1                         487
#define SLRC2                         488
#define SLRC3                         489
#define SLRC4                         490
#define SLRC5                         491
#define INLVLA                        492
#define INLVLA0                       493
#define INLVLA1                       494
#define INLVLA2                       495
#define INLVLA3                       496
#define INLVLA4                       497
#define INLVLA5                       498
#define INLVLC                        499
#define INLVLC0                       500
#define INLVLC1                       501
#define INLVLC2                       502
#define INLVLC3                       503
#define INLVLC4                       504
#define INLVLC5                       505
#define IOCAP                         506
#define IOCAP0                        507
#define IOCAP1                        508
#define IOCAP2                        509
#define IOCAP3                        510
#define IOCAP4                        511
#define IOCAP5                        512
#define IOCAN0                        513
#define IOCAN                         514
#define IOCAN1                        515
#define IOCAN2                        516
#define IOCAN3                        517
#define IOCAN4                        518
#define IOCAN5                        519
#define IOCAF0                        520
#define IOCAF                         521
