tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1613_tdd.h
#define IOCAF1                        522
#define IOCAF2                        523
#define IOCAF3                        524
#define IOCAF4                        525
#define IOCAF5                        526
#define IOCCP                         527
#define IOCCP0                        528
#define IOCCP1                        529
#define IOCCP2                        530
#define IOCCP3                        531
#define IOCCP4                        532
#define IOCCP5                        533
#define IOCCN                         534
#define IOCCN0                        535
#define IOCCN1                        536
#define IOCCN2                        537
#define IOCCN3                        538
#define IOCCN4                        539
#define IOCCN5                        540
#define IOCCF                         541
#define IOCCF0                        542
#define IOCCF1                        543
#define IOCCF2                        544
#define IOCCF3                        545
#define IOCCF4                        546
#define IOCCF5                        547
#define T4TMR                         548
#define TMR4                          549
#define T4PR                          550
#define PR4                           551
#define T4CON                         552
#define T4OUTPS0                      553
#define T4CON_OUTPS                   554
#define T4OUTPS                       555
#define T4CON_OUTPS0                  556
#define T4OUTPS1                      557
#define T4CON_OUTPS1                  558
#define T4CON_OUTPS2                  559
#define T4OUTPS2                      560
#define T4OUTPS3                      561
#define T4CON_OUTPS3                  562
#define T4CON_CKPS0                   563
#define T4CKPS0                       564
#define T4CON_CKPS                    565
#define T4CKPS                        566
#define T4CKPS1                       567
#define T4CON_CKPS1                   568
#define T4CKPS2                       569
#define T4CON_CKPS2                   570
#define T4ON                          571
#define T4CON_ON                      572
#define TMR4ON                        573
#define T4HLT                         574
#define T4MODE                        575
#define T4HLT_MODE                    576
#define T4HLT_MODE0                   577
#define T4MODE0                       578
#define T4HLT_MODE1                   579
#define T4MODE1                       580
#define T4HLT_MODE2                   581
#define T4MODE2                       582
#define T4HLT_MODE3                   583
#define T4MODE3                       584
#define T4HLT_CKSYNC                  585
#define T4CKSYNC                      586
#define T4HLT_CKPOL                   587
#define T4CKPOL                       588
#define T4PSYNC                       589
#define T4HLT_PSYNC                   590
#define T4CLKCON                      591
#define T4CS0                         592
#define T4CS                          593
#define T4CS1                         594
#define T4CS2                         595
#define T4RST                         596
#define T4RSEL0                       597
#define T4RSEL                        598
#define T4RST_RSEL                    599
#define T4RST_RSEL0                   600
#define T4RSEL1                       601
#define T4RST_RSEL1                   602
#define T4RSEL2                       603
#define T4RST_RSEL2                   604
#define T4RSEL3                       605
#define T4RST_RSEL3                   606
#define T6TMR                         607
#define TMR6                          608
#define T6PR                          609
#define PR6                           610
#define T6CON                         611
#define T6CON_OUTPS0                  612
#define T6OUTPS                       613
#define T6CON_OUTPS                   614
#define T6OUTPS0                      615
#define T6CON_OUTPS1                  616
#define T6OUTPS1                      617
#define T6CON_OUTPS2                  618
#define T6OUTPS2                      619
#define T6CON_OUTPS3                  620
#define T6OUTPS3                      621
#define T6CON_CKPS0                   622
#define T6CKPS                        623
#define T6CKPS0                       624
#define T6CON_CKPS                    625
#define T6CON_CKPS1                   626
#define T6CKPS1                       627
#define T6CON_CKPS2                   628
#define T6CKPS2                       629
#define TMR6ON                        630
#define T6ON                          631
#define T6CON_ON                      632
#define T6HLT                         633
#define T6HLT_MODE0                   634
#define T6HLT_MODE                    635
#define T6MODE0                       636
#define T6MODE                        637
#define T6HLT_MODE1                   638
#define T6MODE1                       639
#define T6MODE2                       640
#define T6HLT_MODE2                   641
#define T6HLT_MODE3                   642
#define T6MODE3                       643
#define T6CKSYNC                      644
#define T6HLT_CKSYNC                  645
#define T6CKPOL                       646
#define T6HLT_CKPOL                   647
#define T6PSYNC                       648
#define T6HLT_PSYNC                   649
#define T6CLKCON                      650
#define T6CS                          651
#define T6CS0                         652
#define T6CS1                         653
#define T6CS2                         654
#define T6RST                         655
#define T6RST_RSEL                    656
#define T6RST_RSEL0                   657
#define T6RSEL                        658
#define T6RSEL0                       659
#define T6RST_RSEL1                   660
#define T6RSEL1                       661
#define T6RSEL2                       662
#define T6RST_RSEL2                   663
#define T6RST_RSEL3                   664
#define T6RSEL3                       665
#define CWG1DBR0                      666
#define CWG1DBR                       667
#define DBR                           668
#define DBR0                          669
#define CWG1DBR1                      670
#define DBR1                          671
#define CWG1DBR2                      672
#define DBR2                          673
#define CWG1DBR3                      674
#define DBR3                          675
#define CWG1DBR4                      676
#define DBR4                          677
#define CWG1DBR5                      678
#define DBR5                          679
#define CWG1DBF                       680
#define CWG1DBF0                      681
#define DBF                           682
#define DBF0                          683
#define CWG1DBF1                      684
#define DBF1                          685
#define CWG1DBF2                      686
#define DBF2                          687
#define CWG1DBF3                      688
#define DBF3                          689
#define CWG1DBF4                      690
#define DBF4                          691
#define DBF5                          692
#define CWG1DBF5                      693
#define CWG1AS0                       694
#define CWG1LSAC                      695
#define LSAC                          696
#define LSAC0                         697
#define CWG1LSAC0                     698
#define LSAC1                         699
#define CWG1LSAC1                     700
#define LSBD0                         701
#define CWG1LSBD0                     702
#define LSBD                          703
#define CWG1LSBD                      704
#define LSBD1                         705
#define CWG1LSBD1                     706
#define CWG1REN                       707
#define REN                           708
#define CWG1SHUTDOWN                  709
#define SHUTDOWN                      710
#define CWG1AS1                       711
#define INAS                          712
#define CWG1INAS                      713
#define C1AS                          714
#define CWG1C1AS                      715
#define C2AS                          716
#define CWG1C2AS                      717
#define TMR2AS                        718
#define CWG1TMR2AS                    719
#define CWG1TMR4AS                    720
#define TMR4AS                        721
#define CWG1TMR6AS                    722
#define TMR6AS                        723
#define CWG1OCON0                     724
#define CWG1STRA                      725
#define STRA                          726
#define STRB                          727
#define CWG1STRB                      728
#define CWG1STRC                      729
#define STRC                          730
#define CWG1STRD                      731
#define STRD                          732
#define OVRA                          733
#define CWG1OVRA                      734
#define CWG1OVRB                      735
#define OVRB                          736
#define OVRC                          737
#define CWG1OVRC                      738
#define OVRD                          739
#define CWG1OVRD                      740
#define CWG1CON0                      741
#define CWG1MODE0                     742
#define CWG1CON0_MODE0                743
#define CWG1MODE                      744
#define CWG1CON0_MODE                 745
#define CWG1MODE1                     746
#define CWG1CON0_MODE1                747
#define CWG1MODE2                     748
#define CWG1CON0_MODE2                749
#define LD                            750
#define CWG1LD                        751
#define CWG1CON0_EN                   752
#define CWG1EN                        753
#define G1EN                          754
#define CWG1CON1                      755
#define CWG1POLA                      756
#define POLA                          757
#define CWG1POLB                      758
#define POLB                          759
#define CWG1POLC                      760
#define POLC                          761
#define CWG1POLD                      762
#define POLD                          763
#define IN                            764
#define CWG1IN                        765
#define CWG1OCON1                     766
#define CWG1OEA                       767
#define OEA                           768
#define CWG1OEB                       769
#define OEB                           770
#define CWG1OEC                       771
#define OEC                           772
#define CWG1OED                       773
#define OED                           774
#define CWG1CLKCON                    775
#define CS                            776
#define CWG1CS                        777
#define CWG1ISM                       778
#define CWG1IS                        779
#define IS                            780
#define IS0                           781
#define CWG1IS0                       782
#define CWG1IS1                       783
#define IS1                           784
#define IS2                           785
#define CWG1IS2                       786
#define WDTCON0                       787
#define SWDTEN                        788
#define SEN                           789
#define WDTSEN                        790
#define WDTPS                         791
#define WDTPS0                        792
#define WDTPS1                        793
#define WDTPS2                        794
#define WDTPS3                        795
#define WDTPS4                        796
#define WDTCON1                       797
#define WDTWINDOW0                    798
#define WINDOW0                       799
#define WINDOW                        800
#define WDTWINDOW                     801
#define WDTWINDOW1                    802
#define WINDOW1                       803
#define WDTWINDOW2                    804
#define WINDOW2                       805
#define WDTCS                         806
#define WDTCS0                        807
#define WDTCS1                        808
#define WDTCS2                        809
#define WDTPSL                        810
#define WDTPSL_WDTPSCNT               811
#define WDTPSL_PSCNT                  812
#define WDTPSCNT0                     813
#define PSCNT0                        814
#define WDTPSCNT1                     815
#define PSCNT1                        816
#define WDTPSCNT2                     817
#define PSCNT2                        818
#define WDTPSCNT3                     819
#define PSCNT3                        820
#define WDTPSCNT4                     821
#define PSCNT4                        822
#define WDTPSCNT5                     823
#define PSCNT5                        824
#define WDTPSCNT6                     825
#define PSCNT6                        826
#define WDTPSCNT7                     827
#define PSCNT7                        828
#define WDTPSH                        829
#define PSCNT8                        830
#define WDTPSH_WDTPSCNT               831
#define WDTPSH_PSCNT                  832
#define WDTPSCNT8                     833
#define PSCNT9                        834
#define WDTPSCNT9                     835
#define PSCNT10                       836
#define WDTPSCNT10                    837
#define PSCNT11                       838
#define WDTPSCNT11                    839
#define PSCNT12                       840
#define WDTPSCNT12                    841
#define PSCNT13                       842
#define WDTPSCNT13                    843
#define PSCNT14                       844
#define WDTPSCNT14                    845
#define PSCNT15                       846
#define WDTPSCNT15                    847
#define PSCNT16                       848
#define WDTPSCNT16                    849
#define WDTPSCNT17                    850
#define PSCNT17                       851
#define STATE                         852
#define WDTSTATE                      853
#define WDTTMR                        854
#define WDTTMR0                       855
#define WDTTMR1                       856
#define WDTTMR2                       857
#define WDTTMR3                       858
#define WDTTMR4                       859
#define SCANLADRL                     860
#define SCANLADRL_LADR                861
#define LDAR0                         862
#define SCANLADRL_SCANLADR            863
#define SCANLADR0                     864
#define SCANLADR1                     865
#define LDAR1                         866
#define LADR2                         867
#define SCANLADR2                     868
#define LADR3                         869
#define SCANLADR3                     870
#define LADR4                         871
#define SCANLADR4                     872
#define LADR5                         873
#define SCANLADR5                     874
#define SCANLADR6                     875
#define LADR6                         876
#define LADR7                         877
#define SCANLADR7                     878
#define SCANLADRH                     879
#define LADR8                         880
#define SCANLADRH_SCANLADR            881
#define SCANLADR8                     882
#define SCANLADRH_LADR                883
#define LADR9                         884
#define SCANLADR9                     885
#define LADR10                        886
#define SCANLADR10                    887
#define SCANLADR11                    888
#define LADR11                        889
#define LADR12                        890
#define SCANLADR12                    891
#define LADR13                        892
#define SCANLADR13                    893
#define LADR14                        894
#define SCANLADR14                    895
#define LADR15                        896
#define SCANLADR15                    897
#define SCANHADRL                     898
#define SCANHADR0                     899
#define HADR0                         900
#define SCANHADRL_HADR                901
#define SCANHADRL_SCANHADR            902
#define SCANHADR1                     903
#define HADR1                         904
#define SCANHADR2                     905
#define HARD2                         906
#define SCANHADR3                     907
#define HADR3                         908
#define SCANHADR4                     909
#define HADR4                         910
#define SCANHADR5                     911
#define HADR5                         912
#define SCANHADR6                     913
#define HADR6                         914
#define SCANHADR7                     915
#define HADR7                         916
#define SCANHADRH                     917
#define HADR8                         918
#define SCANHADRH_SCANHADR            919
#define SCANHADR8                     920
#define SCANHADRH_HADR                921
#define HADR9                         922
#define SCANHADR9                     923
#define HADR10                        924
#define SCANHADR10                    925
#define SCANHADR11                    926
#define HADR11                        927
#define HADR12                        928
#define SCANHADR12                    929
#define HADR13                        930
#define SCANHADR13                    931
#define HADR14                        932
#define SCANHADR14                    933
#define HADR15                        934
#define SCANHADR15                    935
#define SCANCON0                      936
#define SCANMODE                      937
#define SCANMODE0                     938
#define SCANCON0_MODE                 939
#define SCANCON0_MODE0                940
#define SCANCON0_MODE1                941
#define SCANMODE1                     942
#define INTM                          943
#define SCANINTM                      944
#define INVALID                       945
#define SCANINVALID                   946
#define SCANCON0_BUSY                 947
#define SCANBUSY                      948
#define SCANGO                        949
#define SCANEN                        950
#define SCANCON0_EN                   951
#define SCANTRIG                      952
#define TSEL0                         953
#define TSEL                          954
#define SCANTSEL0                     955
#define SCANTSEL                      956
#define TSEL1                         957
#define SCANTSEL1                     958
#define CRCDATL                       959
#define CRCDATL_DAT                   960
#define CRCDAT0                       961
#define DAT0                          962
#define CRCDATL_CRCDAT                963
#define CRCDAT1                       964
#define DAT1                          965
#define CRCDAT2                       966
#define DAT2                          967
#define CRCDAT3                       968
#define DAT3                          969
#define CRCDAT4                       970
#define DAT4                          971
#define CRCDAT5                       972
#define DAT5                          973
#define CRCDAT6                       974
#define DAT6                          975
#define DAT7                          976
#define CRDCDAT7                      977
#define CRCDATH                       978
#define CRCDAT8                       979
#define DAT8                          980
#define CRCDATH_CRCDAT                981
#define CRCDATH_DAT                   982
#define CRCDAT9                       983
#define DAT9                          984
#define DAT10                         985
#define CRCDAT10                      986
#define DAT11                         987
#define CRCDAT11                      988
#define DAT12                         989
#define CRCDAT12                      990
#define DAT13                         991
#define CRCDAT13                      992
#define DAT14                         993
#define CRCDAT14                      994
#define DAT15                         995
#define CRCDAT15                      996
#define CRCACCL                       997
#define CRCACC0                       998
#define CRCACCL_ACC                   999
#define CRCACCL_CRCACC                1000
#define ACC0                          1001
#define CRCACC1                       1002
#define ACC1                          1003
#define CRCACC2                       1004
#define ACC2                          1005
#define CRCACC3                       1006
#define ACC3                          1007
#define CRCACC4                       1008
#define ACC4                          1009
#define CRCACC5                       1010
#define ACC5                          1011
#define CRCACC6                       1012
#define ACC6                          1013
#define CRCACC7                       1014
#define ACC7                          1015
#define CRCACCH                       1016
#define CRCACCH_CRCACC                1017
#define CRCACC8                       1018
#define CRCACCH_ACC                   1019
#define ACC8                          1020
#define CRCACC9                       1021
#define ACC9                          1022
#define CRCACC10                      1023
#define ACC10                         1024
#define CRCACC11                      1025
#define ACC11                         1026
#define CRCACC12                      1027
#define ACC12                         1028
#define CRCACC13                      1029
#define ACC13                         1030
#define ACC14                         1031
#define CRCACC14                      1032
#define CRCACC15                      1033
#define ACC15                         1034
#define CRCSHIFTL                     1035
#define CRCSHIFTL_CRCSHIFT            1036
#define CRCSHIFTL_SHIFT               1037
#define SHIFT0                        1038
#define CRCSHIFT0                     1039
#define SHIFT1                        1040
#define CRCSHIFT1                     1041
#define SHIFT2                        1042
#define CRCSHIFT2                     1043
#define SHIFT3                        1044
#define CRCSHIFT3                     1045
#define SHIFT4                        1046
#define CRCSHIFT4                     1047
#define SHIFT5                        1048
#define CRCSHIFT5                     1049
#define SHIFT6                        1050
#define CRCSHIFT6                     1051
#define SHIFT7                        1052
#define CRCSHIFT7                     1053
#define CRCSHIFTH                     1054
#define CRCSHIFT8                     1055
#define CRCSHIFTH_SHIFT               1056
#define CRCSHIFTH_CRCSHIFT            1057
#define SHIFT8                        1058
#define CRCSHIFT9                     1059
#define SHIFT9                        1060
#define SHIFT10                       1061
#define CRCSHIFT10                    1062
#define SHIFT11                       1063
#define CRCSHIFT11                    1064
#define SHIFT12                       1065
#define CRCSHIFT12                    1066
#define SHIFT13                       1067
#define CRCSHIFT13                    1068
#define CRCSHIFT14                    1069
#define SHIFT14                       1070
#define SHIFT15                       1071
#define CRCSHIFT15                    1072
#define CRCXORL                       1073
#define XOR1                          1074
#define CRCXOR1                       1075
#define XOR2                          1076
#define CRCXOR2                       1077
#define XOR3                          1078
#define CRCXOR3                       1079
#define XOR4                          1080
#define CRCXOR4                       1081
#define XOR5                          1082
#define CRCXOR5                       1083
#define XOR6                          1084
#define CRCXOR6                       1085
#define XOR7                          1086
#define CRCXOR7                       1087
#define CRCXORH                       1088
#define XOR8                          1089
#define CRCXOR8                       1090
