tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1613_tdd.h
#define XOR9                          1091
#define CRCXOR9                       1092
#define CRCXOR10                      1093
#define XOR10                         1094
#define CRCXOR11                      1095
#define XOR11                         1096
#define XOR12                         1097
#define CRCXOR12                      1098
#define XOR13                         1099
#define CRCXOR13                      1100
#define CRCXOR14                      1101
#define XOR14                         1102
#define CRCXOR15                      1103
#define XOR15                         1104
#define CRCCON0                       1105
#define CRCFULL                       1106
#define FULL                          1107
#define CRCSHIFTM                     1108
#define SHIFTM                        1109
#define ACCM                          1110
#define CRCACCM                       1111
#define CRCCON0_BUSY                  1112
#define CRCBUSY                       1113
#define CRCGO                         1114
#define CRCCON0_EN                    1115
#define CRCEN                         1116
#define CRCCON1                       1117
#define PLEN0                         1118
#define CRCPLEN0                      1119
#define PLEN                          1120
#define CRCPLEN                       1121
#define PLEN1                         1122
#define CRCPLEN1                      1123
#define PLEN2                         1124
#define CRCPLEN2                      1125
#define PLEN3                         1126
#define CRCPLEN3                      1127
#define DLEN                          1128
#define CRCDLEN                       1129
#define CRCDLEN0                      1130
#define DLEN0                         1131
#define DLEN1                         1132
#define CRCDLEN1                      1133
#define CRCDLEN2                      1134
#define DLEN2                         1135
#define DLEN3                         1136
#define CRCDLEN3                      1137
#define SMT1TMRL                      1138
#define SMT1TMR0                      1139
#define SMT1TMRL_SMT1TMR              1140
#define SMT1TMR1                      1141
#define SMT1TMR2                      1142
#define SMT1TMR3                      1143
#define SMT1TMR4                      1144
#define SMT1TMR5                      1145
#define SMT1TMR6                      1146
#define SMT1TMR7                      1147
#define SMT1TMRH                      1148
#define SMT1TMR8                      1149
#define SMT1TMRH_SMT1TMR              1150
#define SMT1TMR9                      1151
#define SMT1TMR10                     1152
#define SMT1TMR11                     1153
#define SMT1TMR12                     1154
#define SMT1TMR13                     1155
#define SMT1TMR14                     1156
#define SMT1TMR15                     1157
#define SMT1TMRU                      1158
#define SMT1TMR16                     1159
#define SMT1TMRU_SMT1TMR              1160
#define SMT1TMR17                     1161
#define SMT1TMR18                     1162
#define SMT1TMR19                     1163
#define SMT1TMR20                     1164
#define SMT1TMR21                     1165
#define SMT1TMR22                     1166
#define SMT1TMR23                     1167
#define SMT1CPRL                      1168
#define SMT1CPRL_SMT1CPR              1169
#define SMT1CPR0                      1170
#define SMT1CPR1                      1171
#define SMT1CPR2                      1172
#define SMT1CPR3                      1173
#define SMT1CPR4                      1174
#define SMT1CPR5                      1175
#define SMT1CPR6                      1176
#define SMT1CPR7                      1177
#define SMT1CPRH                      1178
#define SMT1CPRH_SMT1CPR              1179
#define SMT1CPR8                      1180
#define SMT1CPR9                      1181
#define SMT1CPR10                     1182
#define SMT1CPR11                     1183
#define SMT1CPR12                     1184
#define SMT1CPR13                     1185
#define SMT1CPR14                     1186
#define SMT1CPR15                     1187
#define SMT1CPRU                      1188
#define SMT1CPR16                     1189
#define SMT1CPRU_SMT1CPR              1190
#define SMT1CPR17                     1191
#define SMT1CPR18                     1192
#define SMT1CPR19                     1193
#define SMT1CPR20                     1194
#define SMT1CPR21                     1195
#define SMT1CPR22                     1196
#define SMT1CPR23                     1197
#define SMT1CPWL                      1198
#define SMT1CPW0                      1199
#define SMT1CPWL_SMT1CPW              1200
#define SMT1CPW1                      1201
#define SMT1CPW2                      1202
#define SMT1CPW3                      1203
#define SMT1CPW4                      1204
#define SMT1CPW5                      1205
#define SMT1CPW6                      1206
#define SMT1CPW7                      1207
#define SMT1CPWH                      1208
#define SMT1CPW8                      1209
#define SMT1CPWH_SMT1CPW              1210
#define SMT1CPW9                      1211
#define SMT1CPW10                     1212
#define SMT1CPW11                     1213
#define SMT1CPW12                     1214
#define SMT1CPW13                     1215
#define SMT1CPW14                     1216
#define SMT1CPW15                     1217
#define SMT1CPWU                      1218
#define SMT1CPWU_SMT1CPW              1219
#define SMT1CPW16                     1220
#define SMT1CPW17                     1221
#define SMT1CPW18                     1222
#define SMT1CPW19                     1223
#define SMT1CPW20                     1224
#define SMT1CPW21                     1225
#define SMT1CPW22                     1226
#define SMT1CPW23                     1227
#define SMT1PRL                       1228
#define SMT1PR0                       1229
#define SMT1PRL_SMT1PR                1230
#define SMT1PR1                       1231
#define SMT1PR2                       1232
#define SMT1PR3                       1233
#define SMT1PR4                       1234
#define SMT1PR5                       1235
#define SMT1PR6                       1236
#define SMT1PR7                       1237
#define SMT1PRH                       1238
#define SMT1PR8                       1239
#define SMT1PRH_SMT1PR                1240
#define SMT1PR9                       1241
#define SMT1PR10                      1242
#define SMT1PR11                      1243
#define SMT1PR12                      1244
#define SMT1PR13                      1245
#define SMT1PR14                      1246
#define SMT1PR15                      1247
#define SMT1PRU                       1248
#define SMT1PR16                      1249
#define SMT1PRU_SMT1PR                1250
#define SMT1PR17                      1251
#define SMT1PR18                      1252
#define SMT1PR19                      1253
#define SMT1PR20                      1254
#define SMT1PR21                      1255
#define SMT1PR22                      1256
#define SMT1PR23                      1257
#define SMT1CON0                      1258
#define SMT1PS0                       1259
#define SMT1PS                        1260
#define SMT1PS1                       1261
#define SMT1CON0_CPOL                 1262
#define SMT1CON0_SPOL                 1263
#define SMT1CON0_WPOL                 1264
#define SMT1CON0_STP                  1265
#define SMT1CON0_EN                   1266
#define SMT1CON1                      1267
#define SMT1MODE0                     1268
#define SMT1CON1_MODE                 1269
#define SMT1CON1_MODE0                1270
#define SMT1MODE                      1271
#define SMT1CON1_MODE1                1272
#define SMT1MODE1                     1273
#define SMT1CON1_MODE2                1274
#define SMT1MODE2                     1275
#define SMT1CON1_MODE3                1276
#define SMT1MODE3                     1277
#define SMT1CON1_REPEAT               1278
#define SMT1REPEAT                    1279
#define SMT1GO                        1280
#define SMT1STAT                      1281
#define SMT1STAT_AS                   1282
#define SMT1AS                        1283
#define SMT1STAT_WS                   1284
#define SMT1WS                        1285
#define SMT1STAT_TS                   1286
#define SMT1TS                        1287
#define SMT1RESET                     1288
#define SMT1STAT_RST                  1289
#define SMT1CPWUP                     1290
#define SMT1STAT_CPWUP                1291
#define SMT1CPRUP                     1292
#define SMT1STAT_CPRUP                1293
#define SMT1CLK                       1294
#define SMT1CLK_CSEL0                 1295
#define SMT1CSEL0                     1296
#define SMT1CSEL                      1297
#define SMT1CLK_CSEL                  1298
#define SMT1CSEL1                     1299
#define SMT1CLK_CSEL1                 1300
#define SMT1CSEL2                     1301
#define SMT1CLK_CSEL2                 1302
#define SMT1SIG                       1303
#define SMT1SSEL                      1304
#define SMT1SIG_SSEL0                 1305
#define SMT1SIG_SSEL                  1306
#define SMT1SSEL0                     1307
#define SMT1SIG_SSEL1                 1308
#define SMT1SSEL1                     1309
#define SMT1SIG_SSEL2                 1310
#define SMT1SSEL2                     1311
#define SMT1WIN                       1312
#define SMT1WSEL                      1313
#define SMT1WSEL0                     1314
#define SMT1WIN_WSEL0                 1315
#define SMT1WIN_WSEL                  1316
#define SMT1WSEL1                     1317
#define SMT1WIN_WSEL1                 1318
#define SMT1WIN_WSEL2                 1319
#define SMT1WSEL2                     1320
#define SMT1WIN_WSEL3                 1321
#define SMT1WSEL3                     1322
#define SMT2TMRL                      1323
#define SMT2TMRL_SMT2TMR              1324
#define SMT2TMR0                      1325
#define SMT2TMR1                      1326
#define SMT2TMR2                      1327
#define SMT2TMR3                      1328
#define SMT2TMR4                      1329
#define SMT2TMR5                      1330
#define SMT2TMR6                      1331
#define SMT2TMR7                      1332
#define SMT2TMRH                      1333
#define SMT2TMR8                      1334
#define SMT2TMRH_SMT2TMR              1335
#define SMT2TMR9                      1336
#define SMT2TMR10                     1337
#define SMT2TMR11                     1338
#define SMT2TMR12                     1339
#define SMT2TMR13                     1340
#define SMT2TMR14                     1341
#define SMT2TMR15                     1342
#define SMT2TMRU                      1343
#define SMT2TMR16                     1344
#define SMT2TMRU_SMT2TMR              1345
#define SMT2TMR17                     1346
#define SMT2TMR18                     1347
#define SMT2TMR19                     1348
#define SMT2TMR20                     1349
#define SMT2TMR21                     1350
#define SMT2TMR22                     1351
#define SMT2TMR23                     1352
#define SMT2CPRL                      1353
#define SMT2CPRL_SMT2CPR              1354
#define SMT2CPR0                      1355
#define SMT2CPR1                      1356
#define SMT2CPR2                      1357
#define SMT2CPR3                      1358
#define SMT2CPR4                      1359
#define SMT2CPR5                      1360
#define SMT2CPR6                      1361
#define SMT2CPR7                      1362
#define SMT2CPRH                      1363
#define SMT2CPR8                      1364
#define SMT2CPRH_SMT2CPR              1365
#define SMT2CPR9                      1366
#define SMT2CPR10                     1367
#define SMT2CPR11                     1368
#define SMT2CPR12                     1369
#define SMT2CPR13                     1370
#define SMT2CPR14                     1371
#define SMT2CPR15                     1372
#define SMT2CPRU                      1373
#define SMT2CPRU_SMT2CPR              1374
#define SMT2CPR16                     1375
#define SMT2CPR17                     1376
#define SMT2CPR18                     1377
#define SMT2CPR19                     1378
#define SMT2CPR20                     1379
#define SMT2CPR21                     1380
#define SMT2CPR22                     1381
#define SMT2CPR23                     1382
#define SMT2CPWL                      1383
#define SMT2CPWL_SMT2CPW              1384
#define SMT2CPW0                      1385
#define SMT2CPW1                      1386
#define SMT2CPW2                      1387
#define SMT2CPW3                      1388
#define SMT2CPW4                      1389
#define SMT2CPW5                      1390
#define SMT2CPW6                      1391
#define SMT2CPW7                      1392
#define SMT2CPWH                      1393
#define SMT2CPWH_SMT2CPW              1394
#define SMT2CPW8                      1395
#define SMT2CPW9                      1396
#define SMT2CPW10                     1397
#define SMT2CPW11                     1398
#define SMT2CPW12                     1399
#define SMT2CPW13                     1400
#define SMT2CPW14                     1401
#define SMT2CPW15                     1402
#define SMT2CPWU                      1403
#define SMT2CPWU_SMT2CPW              1404
#define SMT2CPW16                     1405
#define SMT2CPW17                     1406
#define SMT2CPW18                     1407
#define SMT2CPW19                     1408
#define SMT2CPW20                     1409
#define SMT2CPW21                     1410
#define SMT2CPW22                     1411
#define SMT2CPW23                     1412
#define SMT2PRL                       1413
#define SMT2PRL_SMT2PR                1414
#define SMT2PR0                       1415
#define SMT2PR1                       1416
#define SMT2PR2                       1417
#define SMT2PR3                       1418
#define SMT2PR4                       1419
#define SMT2PR5                       1420
#define SMT2PR6                       1421
#define SMT2PR7                       1422
#define SMT2PRH                       1423
#define SMT2PRH_SMT2PR                1424
#define SMT2PR8                       1425
#define SMT2PR9                       1426
#define SMT2PR10                      1427
#define SMT2PR11                      1428
#define SMT2PR12                      1429
#define SMT2PR13                      1430
#define SMT2PR14                      1431
#define SMT2PR15                      1432
#define SMT2PRU                       1433
#define SMT2PRU_SMT2PR                1434
#define SMT2PR16                      1435
#define SMT2PR17                      1436
#define SMT2PR18                      1437
#define SMT2PR19                      1438
#define SMT2PR20                      1439
#define SMT2PR21                      1440
#define SMT2PR22                      1441
#define SMT2PR23                      1442
#define SMT2CON0                      1443
#define SMT2PS0                       1444
#define SMT2PS                        1445
#define SMT2PS1                       1446
#define SMT2CON0_CPOL                 1447
#define SMT2CON0_SPOL                 1448
#define SMT2CON0_WPOL                 1449
#define SMT2CON0_STP                  1450
#define SMT2CON0_EN                   1451
#define SMT2CON1                      1452
#define SMT2CON1_MODE                 1453
#define SMT2CON1_MODE0                1454
#define SMT2MODE0                     1455
#define SMT2MODE                      1456
#define SMT2CON1_MODE1                1457
#define SMT2MODE1                     1458
#define SMT2CON1_MODE2                1459
#define SMT2MODE2                     1460
#define SMT2CON1_MODE3                1461
#define SMT2MODE3                     1462
#define SMT2REPEAT                    1463
#define SMT2CON1_REPEAT               1464
#define SMT2GO                        1465
#define SMT2STAT                      1466
#define SMT2AS                        1467
#define SMT2STAT_AS                   1468
#define SMT2WS                        1469
#define SMT2STAT_WS                   1470
#define SMT2STAT_TS                   1471
#define SMT2TS                        1472
#define SMT2RESET                     1473
#define SMT2STAT_RST                  1474
#define SMT2CPWUP                     1475
#define SMT2STAT_CPWUP                1476
#define SMT2STAT_CPRUP                1477
#define SMT2CPRUP                     1478
#define SMT2CLK                       1479
#define SMT2CLK_CSEL                  1480
#define SMT2CLK_CSEL0                 1481
#define SMT2CSEL0                     1482
#define SMT2CSEL                      1483
#define SMT2CLK_CSEL1                 1484
#define SMT2CSEL1                     1485
#define SMT2CLK_CSEL2                 1486
#define SMT2CSEL2                     1487
#define SMT2SIG                       1488
#define SMT2SIG_SSEL                  1489
#define SMT2SSEL0                     1490
#define SMT2SSEL                      1491
#define SMT2SIG_SSEL0                 1492
#define SMT2SSEL1                     1493
#define SMT2SIG_SSEL1                 1494
#define SMT2SSEL2                     1495
#define SMT2SIG_SSEL2                 1496
#define SMT2WIN                       1497
#define SMT2WIN_WSEL0                 1498
#define SMT2WSEL0                     1499
#define SMT2WSEL                      1500
#define SMT2WIN_WSEL                  1501
#define SMT2WSEL1                     1502
#define SMT2WIN_WSEL1                 1503
#define SMT2WSEL2                     1504
#define SMT2WIN_WSEL2                 1505
#define SMT2WSEL3                     1506
#define SMT2WIN_WSEL3                 1507
#define STATUS_SHAD                   1508
#define C_SHAD                        1509
#define DC_SHAD                       1510
#define Z_SHAD                        1511
#define WREG_SHAD                     1512
#define BSR_SHAD                      1513
#define PCLATH_SHAD                   1514
#define FSR0L_SHAD                    1515
#define FSR0H_SHAD                    1516
#define FSR1L_SHAD                    1517
#define FSR1H_SHAD                    1518
#define STKPTR                        1519
#define TOSL                          1520
#define TOSH                          1521

#endif // _PIC16LF1613_H_
